	/*
							Указатель на функцию
	Написать программу, которая содержит функцию Action, принимающую
	в качестве параметров указатель на массив типа double, размер массива, а
	также указатель на функцию. Программа должна отобразить пользователю
	меню, в котором он может выбрать один из трех пунктов: maximum, minimum,
	average. Если выбран пункт maximum, то в функцию Action передается адрес
	функции, которая ищет максимум в массиве. Если выбран пункт minimum, то
	в функцию Action передается адрес функции, которая ищет минимум в
	массиве. Если выбран пункт average, то в функцию Action передается адрес
	функции, которая ищет среднее арифметическое элементов массива.
	Возвращаемое значение функции Action – результат, который вернет одна из
	этих трех функций (maximum, minimum, average). Все три функции должны
	принимать в качестве параметров указатель на массив типа double, а также
	размер массива. Функции должны возвращать результат типа double
	*/
#include <iostream>

int main()
{

}